# todo: Заданы три числа в переменных x, y, z.
# Напечатать наибольшее из этих чисел.
# Задачу решить без функций max и прочих.

# Пример:
x = 10
y = 15
z = 2
# Ответ:

if x >= y and x >= z:
    print(f"Наибольшее число {x}")
elif y >= x and y >= z:
    print(f"Наибольшее число {y}")
else:
    print(f"Наибольшее число {z}")


# Пример:
x = 77
y = 9
z = 130
# Ответ:

if x >= y and x >= z:
    print(f"Наибольшее число {x}")
elif y >= x and y >= z:
    print(f"Наибольшее число {y}")
else:
    print(f"Наибольшее число {z}")


